{
  "Version": "1.3",
  "ID": "f1hnvljphtrpwb6pxszxoh7k57br7goo33s6b22ry",
  "Issue Number": "2",
  "Client": {
    "Name": "Prelinger Archives LLC",
    "Region": "United States",
    "Industry": "Information, Media & Telecommunications",
    "Website": "prelingerarchives.online",
    "Social Media": "@prelingerarchives",
    "Social Media Type": "Twitter",
    "Role": "Dataset Owner"
  },
  "Project": {
    "Brief history of your project and organization": "[Prelinger Archives](https://archive.org/details/prelinger) operates open access film archives with a collection of over 40,000 films. We are currently collaborating with [Internet Archive](https://archive.org/details/prelinger) and [Filecoin Foundation for the Decentralized Web](https://medium.com/@FFDWeb/ffdw-works-with-prelinger-archives-to-make-rare-historic-films-more-accessible-using-the-558e4dbec990) to make thousands of historical films accessible through the DWeb.",
    "Is this project associated with other projects/ecosystem stakeholders?": "Yes",
    "Describe the data being stored onto Filecoin": "Archival video scanned from historical film",
    "Where was the data currently stored in this dataset sourced from": "My Own Storage Infra",
    "How do you plan to prepare the dataset": "Data will be prepared using Singularity V2's inline preparation feature on a remote instance hosted by Internet Archive",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "https://archive.org/details/200333_Panama-Pacific_International_Exposition_Opening_Parade",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[X] I confirm",
    "What is the expected retrieval frequency for this data": "Daily",
    "For how long do you plan to keep this dataset stored on Filecoin": "Permanently",
    "In which geographies do you plan on making storage deals": "North America, Europe, Australia (continent)",
    "How will you be distributing your data to storage providers": "HTTP or FTP server, Others",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "1. f02639429, United States",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "No"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "50PiB",
    "Single Size Dataset": "12.5PiB",
    "Replicas": 4,
    "Weekly Allocation": "15TiB"
  },
  "Lifecycle": {
    "State": "Submitted",
    "Validated At": "",
    "Validated By": "",
    "Active": true,
    "Updated At": "2024-05-21 17:26:01.535016870 UTC",
    "Active Request ID": "",
    "On Chain Address": "f1hnvljphtrpwb6pxszxoh7k57br7goo33s6b22ry",
    "Multisig Address": "true",
    "edited": false
  },
  "Allocation Requests": []
}